Repository: doc-autoit-fr/omegat
Catalog: tm/auto/AutoItFr_201503.tmx
Source language: en
Languages: fr

source: A Windows hotfix was released for Windows XP SP1 that contained a bug that prevents the Alt keystroke from being sent (via the Send() function) while BlockInput() is active.
fr: Un correctif Windows a été réalisé pour un bug sous Windows XP SP1 qui empêche l'envoi de l'appui de la touche Alt (envoyé par la fonction Send()) tant que BlockInput() est actif.

source: The Windows bug is fixed in Windows XP SP2 and newer.
fr: Ce bug a été corrigé dans Windows XP SP2 et supérieur.

source: BlockInput() only affects user-input.
fr: BlockInput() affecte seulement les entrées de type utilisateur.

source: Input from functions like Send() or MouseMove() still work.
fr: Les entrées provenant des fonctions comme Send() ou MouseMove() continuent à fonctionner.

source: Run Notepad
fr: Exécute le Bloc-notes

source: Wait 10 seconds for the Notepad window to appear.
fr: Attend 10 secondes pour que la fenêtre du bloc-notes apparaisse.

source: Disable user input from the mouse and keyboard.
fr: Désactive les entrées utilisateur de la souris et du clavier.

source: Wait for 2 seconds.
fr: Attend 2 secondes.

source: Send the 'F5' key to the edit control of Notepad to display the date and time.
fr: Envoie la touche 'F5' au contrôle d'édition de Bloc-notes pour afficher la date et l'heure.

source: The handle returned by WinWait is used for the "title" parameter of ControlSend.
fr: Le handle retourné par WinWait est utilisé pour le paramètre 'titre' de ControlSend.

source: Enable user input from the mouse and keyboard.
fr: Active les entrées utilisateur à partir de la souris et du clavier.

source: Close the Notepad window using the handle returned by WinWait.
fr: Ferme la fenêtre du Bloc-notes en utilisant le handle renvoyé par WinWait.

source: Now a screen will pop up and ask to save the changes, the classname of the window is called
fr: Maintenant, une fenêtre s'ouvrira et demandera d'enregistrer les modifications, le nom de classe de la fenêtre est appelé

source: "#32770" and simulating the "TAB" key to move to the second button in which the "ENTER" is simulated to not "save the file"
fr: \"#32770\" et la simulation de la touche \"TAB\" pour passer au deuxième bouton avec lequel \"ENTER\" est simulé pour ne pas \"enregistrer le fichier\"

source: Enables or disables the users' ability to exit a script from the tray icon menu.
fr: Active ou désactive la possibilité d'arrêter un script depuis le menu de l'icône de la zone de notification.

source: Sets the script break mode:
fr: Règle le mode break du script :

source: 1 = Break is enabled (user can quit) (default)
fr: 1 = Break est activé (l'utilisateur peut quitter) (défaut)

source: 0 = Break is disabled (user cannot quit)
fr: 0 = Break est désactivé (l'utilisateur ne peut pas quitter)

source: Please only disable break with good reason.
fr: Désactivez le break seulement si vous avez une bonne raison de le faire.

source: AutoIt normally creates a tray icon when running, and right-clicking this icon allows the user to pause or exit the script.
fr: Autoit crée normalement une icône dans la barre des tâches lorsqu'il s'exécute et un clic droit sur cette icône permet à l'utilisateur de suspendre ou de sortir du script.

source: If Break() is disabled (0), then the user cannot terminate the script this way.
fr: Si Break() est désactivé (0), alors l'utilisateur ne peut pas terminer le script de cette façon.

source: Disable break
fr: Désactive le break

source: Calls a user-defined or built-in function contained in first parameter.
fr: Appelle une fonction utilisateur ou interne passée dans le premier paramètre.

source: The name of function or function to call.
fr: Le nom de la fonction ou la fonction à appeler.

source: Arguments that will be passed to the function being invoked.
fr: Les arguments qui seront passés à la fonction invoquée.

source: the return value of the called function.
fr: Retourne la valeur de retour de la fonction appelée.

source: Both @error and @extended may contain values if the called function set them.
fr: De même @error et @extended peuvent contenir des valeurs si la fonction appelée les renseigne.

source: sets the @error flag to 0xDEAD and @extended to 0xBEEF if the function does not exist or invalid number of parameters.
fr: Retourne @error = 0xDEAD et @extended = 0xBEEF si la fonction n'existe pas ou si le nombre d'arguments n'est pas correct.

source: A special array can be passed in lieu of individual parameters.
fr: Un tableau spécial peut être passé à la place des paramètres individuels.

source: This array must have its first element set to "CallArgArray" and elements 1 - n will be passed as separate arguments to the function.
fr: Ce tableau doit avoir son premier élément égal à "CallArgArray" et les éléments de 1 à n contiendront les paramètres de la fonction passés séparemment.

source: If using this special array, no other arguments can be passed to Call().
fr: Si vous utilisez ce tableau spécial, aucun autre argument ne pourra être passé à Call().

source: See example for a demonstration.
fr: Consultez l'exemple pour une démonstration.

source: Both Call() itself can set the @error flag or the called function can set the @error flag.
fr: Call() peut définir lui-même le flag @error, tout comme la fonction appelée.

source: If Call() sets the @error flag, the value will be 0xDEAD and @extended will also be set to 0xBEEF.
fr: Si Call() définit le flag @error, la valeur sera 0xDEAD et @extended sera défini à 0xBEEF.

source: See the example for a demonstration of testing for a function that was not found.
fr: Consultez l'exemple pour un exemple de fonction qui n'est pas trouvée.

source: This calls a function accepting no arguments.
fr: Ceci appelle une fonction acceptant aucun argument.

source: This calls a function accepting one argument and passes it an argument.
fr: Ceci appelle une fonction acceptant un argument et le passe en argument.

source: This demonstrates how to use the special array argument.
fr: Ceci démontre comment utiliser le tableau spécial d'arguments.

source: This is required, otherwise, Call() will not recognize the array as containing arguments
fr: Cela est nécessaire, sinon, Call() ne reconnaîtra pas le tableau comme contenant des arguments

source: Parameter one is a string
fr: Le premier paramètre est une chaîne

source: Parameter two is a number
fr: Le paramètre deux est un nombre

source: Parameter three is an array
fr: Le paramètre trois est un tableau

source: We've built the special array, now call the function
fr: Nous avons construit le tableau spécial, maintenant, appelons la fonction

source: Test calling a function that does not exist.
fr: Test de l'appel d'une fonction qui n'existe pas.

source: This shows the proper way to test by
fr: Cela montre la bonne façon de tester ensemble

source: checking that both @error and @extended contain the documented failure values.
fr: les deux flags @error et @extended qui contiennent les erreurs documentées.

source: Opens or closes the CD tray.
fr: Ouvre ou ferme le tiroir d'un lecteur CD.

source: The drive letter of the CD tray to control, in the format D:,
fr: La lettre du lecteur CD à contrôler, dans le format D:,

source: Specifies if you want the CD tray to be open or closed:
fr: Spécifie si vous voulez ouvrir ou fermer le lecteur CD :

source: "open" or "closed"
fr: "open" ou "closed"

source: 0 if drive is locked via CD burning software or if the drive letter is not a CD drive.
fr: Retourne 0 si le lecteur est verrouillé par logiciel de gravure ou si la lettre indiquée n'est pas celle d'un lecteur CD.

source: CDTray() works as expected with virtual CD drives such as DAEMON Tools.
fr: CDTray() fonctionne comme attendu avec des lecteurs CD virtuels tels que des utilitaires de type DAEMON.

source: CDTray() does not work on non-local/mapped CD drives; CDTray() must be run from the computer whose drive it affects.
fr: CDTray() ne fonctionne pas avec des lecteurs CD non locaux ou mappés.

source: CDTray("X:","close") tends to return 0 even on laptop-style cd trays that can only be closed manually.
fr: CDTray()("X:","close") a tendance à retourner 0 même sur des lecteurs CD de portable qui ne peuvent être fermés que manuellement.

source: Open the CD tray on drive E:
fr: Ouvre le tiroir du CD du lecteur E :

source: Returns a number rounded up to the next integer.
fr: Retourne un nombre arrondi à l'entier suivant.

source: Returns the rounded number.
fr: Retourne le nombre arrondi.

source: Assign a Local variable an array containing the numbers.
fr: Assigne une variable locale avec un tableau contenant des nombres.

source: Assign a Local variable a string which will contain the results.
fr: Assigne une variable locale avec une chaîne qui contiendra les résultats.

source: Loop through the array: calculate the ceiling and format the result.
fr: Boucle dans le tableau pour calculer l'arrondi supérieur et formater le résultat.

source: Display the results.
fr: Affiche les résultats.

source: Returns a character corresponding to an ASCII code.
fr: Retourne un caractère correspondant à un code ASCII.

source: An ASCII code in the range 0-255 (e.g.,65 returns the capital letter A).
fr: Un code ASCII compris dans l'intervalle 0-255 (par exemple, 65 retourne la lettre capitale A).

source: a string containing the ASCII representation of the given code.
fr: Retourne une chaîne contenant la représentation ASCII du code donné.

source: an empty string and sets the @error flag to 1 if the ASCIIcode is greater than 255.
fr: Retourne une chaîne vide et @error = 1 si le code ASCII est supérieur à 255.

source: Or $sText &= Chr($i) can be used as well.
fr: Ou $sText &= Chr($i) peut être utilisé.

source: Display the characters between 65 to 90.
fr: Affiche les caractères entre 65 à 90.

source: Returns a character corresponding to a unicode code.
fr: Retourne un caractère correspondant à un code unicode.

source: A unicode code in the range 0-65535 (e.g.,65 returns the capital letter A).
fr: Un code Unicode dans l'intervalle 0-655365 (par exemple, 65 retourne la lettre A capitale).

source: a string containing the representation of the given code.
fr: Retourne une chaîne correspondant à la représentation du code donné.

source: an empty string and sets the @error flag to non-zero if the UNICODE value is greater than 65535.
fr: Retourne une chaîne vide et @error = 1 si le code est plus grand que 65535.

source: Or $sText &= ChrW($i) can be used as well.
fr: Ou $sText &= ChrW($i) peut être utilisé.

source: Display the unicode characters between 256 to 512.
fr: Affiche les caractères Unicode entre 256-512.

source: Clipboard user defined functions Reference
fr: Clipboard - Référence

source: When using them you need to add a #include <WinAPISys.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <WinAPISys.au3>.

source: Retrieves text from the clipboard.
fr: Récupère le texte contenu dans le presse-papiers.

source: a string containing the text on the clipboard.
fr: Retourne une chaîne contenant le texte du presse-papiers.

source: sets the @error to non-zero.
fr: Retourne @error <> 0.

source: 1 = if clipboard is empty
fr: 1 = si le presse papier est vide.

source: 2 = if contains a non-text entry.
fr: 2 =si il contient une entrée de type non-texte.

source: 3 or 4 = if cannot access the clipboard.
fr: 3 ou 4 = si on ne peut pas accéder au presse papier.

source: When multiple selecting file/dir are stored in the clipboard, the filename/dirname are returned as texts separated by @LF.
fr: Lorsque le presse papier contient plusieurs sélections de fichiers/répetroires, les noms des fichiers/répertoires sont retournés comme textes séparés par des @LF.

source: Retrieve the data stored in the clipboard.
fr: Récupére les données stockées dans le presse-papier.

source: Display the data returned by ClipGet.
fr: Affiche les données renvoyées par ClipGet.

source: Add new data to the clipboard.
fr: Ajoute de nouvelles données dans le presse papier.

source: Writes text to the clipboard.
fr: Écrit du texte dans le presse-papiers.

source: The text to write to the clipboard.
fr: Le texte à écrire dans le presse-papier.

source: Any existing clipboard contents are overwritten.
fr: Tout contenu existant dans le presse-papier est remplacé.

source: An empty string "" will empty the clipboard.
fr: Une chaîne de caractère vide "" videra le presse-papiers.

source: Color user defined functions Reference
fr: Color - Référence

source: When using them you need to add a #include <WinAPIGdi.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <WinAPIGdi.au3>.

source: Read from the STDIN stream of the AutoIt script process.
fr: Lit à partir du flux STDIN du processus du script AutoIt.

source: If True the function does not remove the read characters from the stream.
fr: Si vrai (true) la fonction ne supprime pas les caractères lus à partir du flux.

source: If True the function reads the data as binary instead of text (default is text).
fr: Si vrai (true) la fonction lit les données sous forme binaire au lieu du format texte (Texte par défaut).

source: the data read.
fr: Retourne les données lues.

source: @extended contains the number of bytes read.
fr: @extended contient le nombre d'octets lus.

source: sets the @error flag to non-zero if EOF is reached, STDIN is not connected for the process or other error.
fr: Retourne @error <> 0 si EOF est atteint, STDIN n'est pas connecté au processus ou autre erreur.

source: ConsoleRead() reads from the console standard input stream of the AutoIt script process, which is normally used by console applications to read input from a parent process.
fr: ConsoleRead() lit à partir du flux d'entrée de la console du processus du script AutoIt, qui est normalement utilisée par les applications console pour lire des données d'entrée depuis un processus parent.

source: ConsoleRead() does not block, it will return immediately.
fr: ConsoleRead() n'est pas bloquante, le retour est immédiat.

source: In order to get all data, it must be called in a loop.
fr: Afin d'obtenir toutes les données, elle doit être appelée dans une boucle.

source: Peeking on the stream does not remove the data from the buffer, however, it does return the available data as normal.
fr: Consulter le flux ne supprime pas les données de la mémoire tampon, cependant, elle renvoie les données disponibles comme d'habitude.

source: By default, data is returned in text format.
fr: Par défaut, les données sont renvoyées au format texte.

source: By using the binary option, the data will be returned in binary format.
fr: En utilisant l'option binary, les données seront renvoyées au format binaire.

source: Writes data to the STDOUT stream.
fr: Écrit des données dans le flux STDOUT.

source: Some text editors can read this stream as can other programs which may be expecting data on this stream.
fr: Certains éditeurs de texte peuvent lire ce flux tout comme d'autres programmes peuvent attendre les données de ce flux.

source: The data you wish to output.
fr: Les données que vous souhaitez écrire.

source: This may either be text or binary.
fr: Elle peuvent être au format texte ou binaire.

source: The amount of data written.
fr: Retourne la quantité de données écrites.

source: If writing binary, the number of bytes written, if writing text, the number of characters written.
fr: Si l'écriture est binaire, se sera le nombre d'octets écrits, si l'écriture est du texte, alors ce sera le nombre de caractères écrits.

source: The purpose for this function is to write to the STDOUT stream.
fr: Le but de cette fonction est d'écrire dans le flux STDOUT.

source: Many popular text editors can read this stream.
fr: De nombreux éditeurs texte peuvent lire ce flux.

source: Scripts compiled as Console applications also have a STDOUT stream.
fr: Les scripts compilés comme applications console ont aussi un flux STDOUT.

source: This does not write to a DOS console unless the script is compiled as a console application.
fr: Cette fonction ne peut pas écrire dans une console DOS sauf si le script est compilé en tant qu'application console.

source: Characters are converted to ANSI before being written.
fr: Les caractères sont convertis à la norme ANSI, avant d'être écrits.

source: Binary data is written as-is.
fr: Les données binaires sont écrites telle quelles.

source: It will not be converted to a string.
fr: Elles ne seront pas converties en une chaîne.

source: To print the hex representation of binary data, use the String() function to explicitly cast the data to a string.
fr: Pour imprimer la représentation hexadécimale de données binaires, utilisez la fonction String() pour convertir explicitement les données en une chaîne.

source: Running this in a text editor which can trap console output e.g.SciTE, will display value of $sString.
fr: L'exécution dans un éditeur de texte qui peut capter les sorties de la console, par exemple SciTE, affiche la valeur de $sChaine.

source: Example 2 for writing in SciTe output pane
fr: Exemple 2 pour écrire dans Scite

source: = red text color
fr: = Rouge couleur du texte

source: > = blue text color
fr: > = Bleu couleur du texte

source: - = orange text color
fr: - = Orange, couleur du texte

source: + = green text color
fr: + = Vert couleur du texte

source: '(5) :' red text color and double click jumps to (line number)
fr: '(5) :' rouge couleur du texte et un double-clic saute à (numéro de ligne)

source: pink text color, any sign and then @TAB & 'line number'
fr: rose couleur du texte, tout signe, puis @TAB & 'numéro de ligne'

source: Clear console output pane of SciTE after 5000 ms
fr: Effacer la sortie de la console dans le volet de SciTE après 5000 ms

source: Writes data to the STDERR stream.
fr: Écrit des données dans le flux STDERR.

source: The purpose for this function is to write to the STDERR stream.
fr: Le but de cette fonction est d'écrire dans le flux STDERR.

source: Scripts compiled as Console applications also have a STDERR stream.
fr: Les scripts compilés comme applications console ont aussi un flux STDERR.

source: Sends a mouse click command to a given control.
fr: Envoie un clic de souris sur un contrôle spécifié.

source: The title/hWnd/class of the window to access.
fr: Le titre/hWnd/class de la fenêtre à atteindre.

source: See Title special definition.
fr: Consultez Définition spéciale de titre.

source: The text of the window to access.
fr: Le texte de la fenêtre à atteindre.

source: See Text special definition.
fr: Consultez Définition spéciale de texte.

source: The control to interact with.
fr: Le contrôle avec lequel interagir.

source: See Controls.
fr: Consultez Controls.

source: The button to click, "left", "right", "middle", "main", "menu", "primary", "secondary".
fr: Le bouton à cliquer :"left", "right", "middle", "main", "menu", "primary", "secondary".

source: Default is the left button.
fr: Bouton gauche ("left") par défaut.

source: The number of times to click the mouse.
fr: Le nombre de clics à effectuer sur le contrôle.

source: Default is 1.
fr: 1 par défaut.

source: The x position to click within the control.
fr: La position x du clic sur le contrôle.

source: Default is center.
fr: Centré par défaut.

source: The y position to click within the control.
fr: La position y du clic sur le contrôle.

source: Some controls will resist clicking unless they are the active window.
fr: Certains contrôles peuvent résister aux clics tant qu'ils ne sont pas dans la fenêtre active.

source: Use the WinActivate() function to force the control's window to the top before using ControlClick().
fr: Utilisez la fonction WinActivate() pour mettre la fenêtre des contrôles au premier plan avant d'utiliser ControlClick().

source: Using 2 for the number of clicks will send a double-click message to the control - this can even be used to launch programs from an explorer control!
fr: La valeur 2 pour le nombre de clics permettra d'effectuer un double-clic sur le contrôle - Cela peut également servir à lancer des programmes depuis une fenêtre de l'explorateur !

source: If the user has swapped the left and right mouse buttons in the control panel, then the behaviour of the buttons is different.
fr: Si l'utilisateur a permuté les boutons gauche et droite de la souris dans le panneau de configuration, alors le comportement de la fonction est différent.

source: "Left" and "right" always click those buttons, whether the buttons are swapped or not.
fr: "Left" et "right" cliquent respectivement sur les boutons gauche et droite, qu'ils soient inversés ou non.

source: The "primary" or "main" button will be the main click, whether or not the buttons are swapped.
fr: Le bouton "primary" ou "main" seront le clic principal même si les boutons sont permutés.

source: The "secondary" or "menu" buttons will usually bring up the context menu, whether the buttons are swapped or not.
fr: Le bouton "secondary" ou "menu" feront apparaitre le menu contextuel même si les boutons sont permutés.

source: Button
fr: Bouton

source: Swapped
fr: Permuté

source: Left
fr: Gauche

source: Middle
fr: Milieu

source: Right
fr: Droite

source: Send a mouse click to the edit control of Notepad using the handle returned by WinWait.
fr: Envoie un clic de souris vers le contrôle d'édition de bloc-notes à l'aide du handle renvoyé par WinWait.

source: Sends a command to a control.
fr: Envoie une commande à un contrôle.

source: The command to send to the control.
fr: La commande à envoyer au contrôle.

source: Additional parameter required by some commands.
fr: Paramètres additionnels requis par certaines commandes.

source: Return depends on command as table below shows.
fr: La valeur retournée dépend de la commande comme le montre le tableau ci-dessous.

source: In case of an error (such as an invalid command or window/control), @error=1.
fr: En cas d'erreur (telle qu'une commande ou fenêtre/contrôle invalide) @error=1.

source: Returns 1 if Control is visible, 0 otherwise
fr: Retourne 1 si le contrôle est visible, sinon 0

source: Returns 1 if Control is enabled, 0 otherwise
fr: Retourne 1 si le contrôle est actif, sinon 0

source: Displays the ComboBox dropdown
fr: Déplie un contrôle type ComboBox

source: Hides the ComboBox dropdown
fr: Replie un contrôle type ComboBox

source: Adds a string to the end in a ListBox or ComboBox
fr: Ajoute la chaîne 'string' à la fin d'un contrôle type ListBox ou ComboBox

source: Deletes a string according to occurrence in a ListBox or ComboBox
fr: Efface une chaîne en fonction de sont occurrence dans un contrôle type ListBox ou ComboBox

source: Returns occurrence ref of the exact string in a ListBox or ComboBox
fr: Retourne la position de la chaine 'string' d'un contrôle type ListBox ou ComboBox

source: Sets selection to occurrence ref in a ListBox or ComboBox
fr: Sélectionne une chaine en fonction de sont occurrence dans un contrôle type ListBox ou ComboBox

source: Sets selection according to string in a ListBox or ComboBox
fr: Sélectionne la chaine 'string' dans un contrôle type ListBox ou ComboBox

source: Returns 1 if Button is checked, 0 otherwise
fr: Retourne 1 si le contrôle est coché, sinon 0

source: Checks radio or check Button
fr: Coche le contrôle type CheckBox ou RadioBox

source: Unchecks radio or check Button
fr: Décoche le contrôle type CheckBox ou RadioBox

source: Returns the line # where the caret is in an Edit
fr: Retourne le numéro de la ligne positionnée sous le curseur, dans un contrôle type Edit

source: Returns the column # where the caret is in an Edit
fr: Retourne le numéro de la colonne positionnée sous le curseur, dans un contrôle type Edit
